w03/d05/chris/moma/app/controllers/artists_controller.rb

SELECT  "artists".* FROM "artists"  WHERE "artists"."id" = ? LIMIT 1  [["id", 3]]
---
  def show #step 6
    @artist = Artist.find(params[:id])

INSERT INTO "artists" ("created_at", "first_name", "image", "last_name", "nationality", "period", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create  #step 5 once submit is hit, it will direct to create method
    @artist = Artist.create(artist_params) #create is with the artist_params so it will be able to access the private method

SELECT  "artists".* FROM "artists"  WHERE "artists"."id" = ? LIMIT 1  [["id", 3]]
---
  def edit #similar to show
    @artist = Artist.find(params[:id])

SELECT  "artists".* FROM "artists"  WHERE "artists"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "artists" SET "date_of_birth" = ?, "updated_at" = ? WHERE "artists"."id" = 3  [["date_of_birth", "0001-01-01"], ["updated_at", "2014-11-28 06:24:17.966767"]]
---
  def update #find and similar to create
    @artist = Artist.find(params[:id])
    @artist.update(artist_params)