w03/d05/chris/moma/app/controllers/paintings_controller.rb

  def create
    @painting = Painting.create(painting_params)
---
INSERT INTO "paintings" ("created_at", "image", "medium", "style", "title", "updated_at", "year") VALUES (?, ?, ?, ?, ?, ?, ?)  [["created_at", "2014-11-29 00:49:29.002879"], ["image", ""], ["medium", ""], ["style", ""], ["title", ""], ["updated_at", "2014-11-29 00:49:29.002879"], ["year", ""]]

  def show
    @painting = Painting.find(params[:id])
---
SELECT  "paintings".* FROM "paintings"  WHERE "paintings"."id" = ? LIMIT 1  [["id", 6]]

  def edit
    @painting = Painting.find(params[:id])
---
SELECT  "paintings".* FROM "paintings"  WHERE "paintings"."id" = ? LIMIT 1  [["id", 7]]

  def update
     @painting = Painting.find(params[:id])
     @painting.update(painting_params)
---
SELECT  "paintings".* FROM "paintings"  WHERE "paintings"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "paintings" SET "title" = ?, "updated_at" = ? WHERE "paintings"."id" = 7  [["title", "The Fewlish one"], ["updated_at", "2014-11-29 01:13:52.048237"]]